jvictorrr/IDENTIFICATION-OF-MECHANICAL-FAILURES/Vibration_Analysis - STM32 F401RE/Src/idp005_uart.c
/**
  ******************************************************************************
  * @file    idp005_uart.c
  * @author  System Research & Applications Team - Catania Lab.
  * @version $Version$
  * @date    $Date$
  * @brief   This file provides the global UART implementation
  ******************************************************************************
  * @attention
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "idp005_uart.h"
#include "idp005_periph_conf.h"

/** @addtogroup Projects
  * @{
  */

/** @addtogroup APPLICATIONS Applications
  * @{
  */

/** @addtogroup VIBRATION_ANALYSIS Vibration Analysis
  * @{
  */

/** @addtogroup IDP005_UART IDP005_UART
  * @{
  */

/** @defgroup IDP005_UART_PRIVATE_VARIABLES IDP005_UART Private Variables
  * @{
  */

UART_HandleTypeDef UartHandle;    /* Global UART handle */

/**
  * @}
  */

/** @addtogroup IDP005_UART_EXPORTED_FUNCTIONS IDP005_UART Exported Functions
  * @{
  */

/**
 * @brief  Configures UART interface
 * @param  None
 * @retval HAL status
 */
HAL_StatusTypeDef UART_Global_Init(void)
{
  HAL_StatusTypeDef ret_val = HAL_OK;
  
  if(HAL_UART_GetState(&UartHandle) == HAL_UART_STATE_RESET) 
  {
    /* DMA controller clock enable */
    SRV_UART_DMA_CLK_ENABLE();
    
    /* Service UART DMA Stream IRQ interrupt configuration for RX */
    HAL_NVIC_SetPriority(SRV_UART_RX_DMA_Stream_IRQn, SRV_UART_RX_DMA_Stream_IRQ_PP, SRV_UART_RX_DMA_Stream_IRQ_SP);
    HAL_NVIC_EnableIRQ(SRV_UART_RX_DMA_Stream_IRQn);
    
    /* Service UART DMA Stream IRQ interrupt configuration for TX */
    HAL_NVIC_SetPriority(SRV_UART_TX_DMA_Stream_IRQn, SRV_UART_TX_DMA_Stream_IRQ_PP, SRV_UART_TX_DMA_Stream_IRQ_SP);
    HAL_NVIC_EnableIRQ(SRV_UART_TX_DMA_Stream_IRQn);
    
    /* I2C configuration */
    UartHandle.Instance          = SRV_UART;
    UartHandle.Init.BaudRate     = SRV_UART_BAUDRATE;
    UartHandle.Init.WordLength   = UART_WORDLENGTH_8B;
    UartHandle.Init.StopBits     = UART_STOPBITS_1;
    UartHandle.Init.Parity       = UART_PARITY_NONE;
    UartHandle.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    UartHandle.Init.Mode         = UART_MODE_TX_RX;
    UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;
    
    ret_val = HAL_UART_Init(&UartHandle);
  }
  return ret_val;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2019 STMicroelectronics *****END OF FILE****/
